Table of Contents
 Class IdeaElement2D
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaElement2D : AbstractIdeaObject<IIdeaElement2D>, IEquatable<AbstractIdeaObject<IIdeaElement2D>>, IIdeaElement2D, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaElement2D>
IdeaElement2D
Implements
IEquatable<AbstractIdeaObject<IIdeaElement2D>>
IIdeaElement2D
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaElement2D>.Id
 AbstractIdeaObject<IIdeaElement2D>.Name
 AbstractIdeaObject<IIdeaElement2D>.Identifier
 AbstractIdeaObject<IIdeaElement2D>.GetHashCode()
 AbstractIdeaObject<IIdeaElement2D>.Equals(object)
 AbstractIdeaObject<IIdeaElement2D>.Equals(AbstractIdeaObject<IIdeaElement2D>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaElement2D(Identifier<IIdeaElement2D>)
public IdeaElement2D(Identifier<IIdeaElement2D> identifer)
Parameters
identifer Identifier<IIdeaElement2D>
 IdeaElement2D(int)
public IdeaElement2D(int id)
Parameters
id int
 IdeaElement2D(string)
public IdeaElement2D(string id)
Parameters
id string
Properties
 EccentricityZ
Displacement in local axis Z
public virtual double EccentricityZ { get; set; }
Property Value
double
 ElementType
Analysis type - shell, plate, wall
public virtual Element2DType ElementType { get; set; }
Property Value
Element2DType
 GeometricRegion
Geometry region of element2D
public virtual IIdeaRegion3D GeometricRegion { get; set; }
Property Value
IIdeaRegion3D
 InnerLines
Inner lines of this region
public virtual List<IIdeaPolyLine3D> InnerLines { get; set; }
Property Value
List<IIdeaPolyLine3D>
 InnerPoints
Inner points of this region
public virtual List<IIdeaNode> InnerPoints { get; set; }
Property Value
List<IIdeaNode>
 Material
Material
public virtual IIdeaMaterial Material { get; set; }
Property Value
IIdeaMaterial
 Thickness
Thicknes of Element2D
public virtual double Thickness { get; set; }
Property Value
double
 Edit this page